Ivansquark/ch32/ch32v307/templates/inc/gpios.h
#ifndef GPIOS_H
#define GPIOS_H

#include "ch32v30x.h"

namespace Gpios {
inline void initLedGreen() {
    RCC->APB2PCENR |= RCC_IOPBEN;
    GPIOB->CFGLR |= GPIO_CFGLR_MODE4;
    GPIOB->CFGLR &= ~GPIO_CFGLR_CNF4;
}

inline void setLedGreen() { GPIOB->BSHR = GPIO_BSHR_BS4; }

inline void resetLedGreen() { GPIOB->BSHR = GPIO_BSHR_BR4; }

using io = volatile uint32_t;

constexpr uint32_t CFGLR = 0x0;
constexpr uint32_t CFGHR = 0x4;
constexpr uint32_t INDR = 0x8;
constexpr uint32_t OUTDR = 0xC;
constexpr uint32_t BSHR = 0x10;

enum PortName
{
    PA,
    PB,
    PC,
    PD,
    PE
};

enum PortSpeed
{
    HIGH = 1,
    LOW = 2,
    MAX = 3
};

enum InitModeIn : uint8_t
{
    ANALOG,
    FLOATING,
    PULL_DOWN,
    PULL_UP
};

enum InitModeOut
{
    PUSH_PULL,
    OPEN_DRAIN,
    ALTERNATE_PUSH_PULL,
    ALTERNATE_OPEN_DRAIN
};

template <PortName portName, uint8_t num, InitModeIn mode = FLOATING> class In {
  public:
    In() {
        setRCC();
        setMode();
    }
    static constexpr void setMode() {
        if constexpr (mode == ANALOG) {
            if constexpr (num == 0) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE0 | GPIO_CFGLR_CNF0);
            } else if constexpr (num == 1) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE1 | GPIO_CFGLR_CNF1);
            } else if constexpr (num == 2) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE2 | GPIO_CFGLR_CNF2);
            } else if constexpr (num == 3) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE3 | GPIO_CFGLR_CNF3);
            } else if constexpr (num == 4) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE4 | GPIO_CFGLR_CNF4);
            } else if constexpr (num == 5) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE5 | GPIO_CFGLR_CNF5);
            } else if constexpr (num == 6) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE6 | GPIO_CFGLR_CNF6);
            } else if constexpr (num == 7) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE7 | GPIO_CFGLR_CNF7);
            } else if constexpr (num == 8) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 9) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 10) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 11) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 12) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 13) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 14) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            } else if constexpr (num == 15) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
            }
        } else if constexpr (mode == FLOATING) {
            if constexpr (num == 0) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE0 | GPIO_CFGLR_CNF0);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF0_0;
            } else if constexpr (num == 1) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE1 | GPIO_CFGLR_CNF1);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF1_0;
            } else if constexpr (num == 2) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE2 | GPIO_CFGLR_CNF2);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF2_0;
            } else if constexpr (num == 3) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE3 | GPIO_CFGLR_CNF3);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF3_0;
            } else if constexpr (num == 4) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE4 | GPIO_CFGLR_CNF4);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF4_0;
            } else if constexpr (num == 5) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE5 | GPIO_CFGLR_CNF5);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF5_0;
            } else if constexpr (num == 6) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE6 | GPIO_CFGLR_CNF6);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF6_0;
            } else if constexpr (num == 7) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE7 | GPIO_CFGLR_CNF7);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF7_0;
            } else if constexpr (num == 8) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF8_0;
            } else if constexpr (num == 9) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE9 | GPIO_CFGHR_CNF9);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF9_0;
            } else if constexpr (num == 10) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE10 | GPIO_CFGHR_CNF10);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF10_0;
            } else if constexpr (num == 11) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE11 | GPIO_CFGHR_CNF11);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF11_0;
            } else if constexpr (num == 12) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE12 | GPIO_CFGHR_CNF12);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF12_0;
            } else if constexpr (num == 13) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE13 | GPIO_CFGHR_CNF13);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF13_0;
            } else if constexpr (num == 14) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE14 | GPIO_CFGHR_CNF14);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF14_0;
            } else if constexpr (num == 15) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE15 | GPIO_CFGHR_CNF15);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF15_0;
            }
        } else if constexpr (mode == PULL_DOWN) {
            if constexpr (num == 0) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE0 | GPIO_CFGLR_CNF0);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF0_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR0;
            } else if constexpr (num == 1) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE1 | GPIO_CFGLR_CNF1);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF1_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR1;
            } else if constexpr (num == 2) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE2 | GPIO_CFGLR_CNF2);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF2_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR2;
            } else if constexpr (num == 3) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE3 | GPIO_CFGLR_CNF3);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF3_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR3;
            } else if constexpr (num == 4) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE4 | GPIO_CFGLR_CNF4);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF4_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR4;
            } else if constexpr (num == 5) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE5 | GPIO_CFGLR_CNF5);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF5_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR5;
            } else if constexpr (num == 6) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE6 | GPIO_CFGLR_CNF6);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF6_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR6;
            } else if constexpr (num == 7) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE7 | GPIO_CFGLR_CNF7);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF7_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR7;
            } else if constexpr (num == 8) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF8_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR8;
            } else if constexpr (num == 9) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE9 | GPIO_CFGHR_CNF9);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF9_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR9;
            } else if constexpr (num == 10) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE10 | GPIO_CFGHR_CNF10);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF10_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR10;
            } else if constexpr (num == 11) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE11 | GPIO_CFGHR_CNF11);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF11_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR11;
            } else if constexpr (num == 12) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE12 | GPIO_CFGHR_CNF12);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF12_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR12;
            } else if constexpr (num == 13) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE13 | GPIO_CFGHR_CNF13);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF13_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR13;
            } else if constexpr (num == 14) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE14 | GPIO_CFGHR_CNF14);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF14_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR14;
            } else if constexpr (num == 15) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE15 | GPIO_CFGHR_CNF15);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF15_1;
                *(io*)(addr + OUTDR) &= ~GPIO_OUTDR_ODR15;
            }
        } else if constexpr (mode == PULL_UP) {
            if constexpr (num == 0) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE0 | GPIO_CFGLR_CNF0);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF0_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR0;
            } else if constexpr (num == 1) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE1 | GPIO_CFGLR_CNF1);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF1_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR1;
            } else if constexpr (num == 2) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE2 | GPIO_CFGLR_CNF2);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF2_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR2;
            } else if constexpr (num == 3) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE3 | GPIO_CFGLR_CNF3);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF3_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR3;
            } else if constexpr (num == 4) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE4 | GPIO_CFGLR_CNF4);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF4_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR4;
            } else if constexpr (num == 5) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE5 | GPIO_CFGLR_CNF5);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF5_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR5;
            } else if constexpr (num == 6) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE6 | GPIO_CFGLR_CNF6);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF6_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR6;
            } else if constexpr (num == 7) {
                *(io*)(addr + CFGLR) &= ~(GPIO_CFGLR_MODE7 | GPIO_CFGLR_CNF7);
                *(io*)(addr + CFGLR) |= GPIO_CFGLR_CNF7_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR7;
            } else if constexpr (num == 8) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE8 | GPIO_CFGHR_CNF8);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF8_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR8;
            } else if constexpr (num == 9) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE9 | GPIO_CFGHR_CNF9);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF9_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR9;
            } else if constexpr (num == 10) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE10 | GPIO_CFGHR_CNF10);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF10_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR10;
            } else if constexpr (num == 11) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE11 | GPIO_CFGHR_CNF11);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF11_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR11;
            } else if constexpr (num == 12) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE12 | GPIO_CFGHR_CNF12);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF12_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR12;
            } else if constexpr (num == 13) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE13 | GPIO_CFGHR_CNF13);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF13_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR13;
            } else if constexpr (num == 14) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE14 | GPIO_CFGHR_CNF14);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF14_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR14;
            } else if constexpr (num == 15) {
                *(io*)(addr + CFGHR) &= ~(GPIO_CFGHR_MODE15 | GPIO_CFGHR_CNF15);
                *(io*)(addr + CFGHR) |= GPIO_CFGHR_CNF15_1;
                *(io*)(addr + OUTDR) |= GPIO_OUTDR_ODR15;
            }
        }
    }
    static bool getState() {
        if constexpr (num == 0) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR0;
        } else if constexpr (num == 1) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR1;
        } else if constexpr (num == 2) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR2;
        } else if constexpr (num == 3) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR3;
        } else if constexpr (num == 4) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR4;
        } else if constexpr (num == 5) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR5;
        } else if constexpr (num == 6) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR6;
        } else if constexpr (num == 7) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR7;
        } else if constexpr (num == 8) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR8;
        } else if constexpr (num == 9) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR9;
        } else if constexpr (num == 10) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR10;
        } else if constexpr (num == 11) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR11;
        } else if constexpr (num == 12) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR12;
        } else if constexpr (num == 13) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR13;
        } else if constexpr (num == 14) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR14;
        } else if constexpr (num == 15) {
            return *(io*)(addr + INDR) & GPIO_INDR_IDR15;
        }
    }

