Ivansquark/ch32/ch32v307/templates/inc/gpios.h
    // metod to set port output speed
    // usualy is max speed (so no need speed in template parameter)
    static constexpr void setSpeed(PortSpeed speed) {
        if constexpr (num == 0) {
            *(io*)(addr + CFGLR) &= ~((~speed) & 0x3);
        } else if constexpr (num == 1) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 4);
        } else if constexpr (num == 2) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 8);
        } else if constexpr (num == 3) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 12);
        } else if constexpr (num == 4) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 16);
        } else if constexpr (num == 5) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 20);
        } else if constexpr (num == 6) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 24);
        } else if constexpr (num == 7) {
            *(io*)(addr + CFGLR) &= ~(((~speed) & 0x3) << 28);
        } else if constexpr (num == 8) {
            *(io*)(addr + CFGHR) &= ~((~speed) & 0x3);
        } else if constexpr (num == 9) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 4);
        } else if constexpr (num == 10) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 8);
        } else if constexpr (num == 11) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 12);
        } else if constexpr (num == 12) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 16);
        } else if constexpr (num == 13) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 20);
        } else if constexpr (num == 14) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 24);
        } else if constexpr (num == 15) {
            *(io*)(addr + CFGHR) &= ~(((~speed) & 0x3) << 28);
        }
    }

  private:
    static constexpr uint32_t whichGPIO() {
        if (PA == portName) {
            return GPIOA_BASE;
        } else if constexpr (PB == portName) {
            return GPIOB_BASE;
        } else if constexpr (PC == portName) {
            return GPIOC_BASE;
        } else if constexpr (PD == portName) {
            return GPIOD_BASE;
        } else if constexpr (PE == portName) {
            return GPIOE_BASE;
        }
    }
    static constexpr uint32_t addr = whichGPIO();
    static constexpr void setRCC() {
        if constexpr (addr == GPIOA_BASE) {
            RCC->APB2PCENR |= RCC_IOPAEN;
        } else if constexpr (addr == GPIOB_BASE) {
            RCC->APB2PCENR |= RCC_IOPBEN;
        } else if constexpr (addr == GPIOC_BASE) {
            RCC->APB2PCENR |= RCC_IOPCEN;
        } else if constexpr (addr == GPIOD_BASE) {
            RCC->APB2PCENR |= RCC_IOPDEN;
        } else if constexpr (addr == GPIOE_BASE) {
            RCC->APB2PCENR |= RCC_IOPEEN;
        }
    }
};

//

// template <PortName portName, uint8_t num, InitModeOut mode> class OUT {
//  public:
//    OUT() {
//        setRCC();
//        setMode();
//    }
//    static constexpr void setMode() {
//        switch (mode) {
//        case PUSH_PULL:
//            *(io*)(addr + CFGHR * IsLowOrHigh) &=
//                ~(0xF << (num - (8 - num % 8) * (IsLowOrHigh)) * 4);
//            *(io*)(addr + CFGHR * IsLowOrHigh) |=
//                (3 << (num - (8 - num % 8) * IsLowOrHigh) * 4);
//            break;
//        case OPEN_DRAIN:
//            *(io*)(addr + CFGHR * IsLowOrHigh) &=
//                ~(0xF << (num - (8 - num % 8) * (IsLowOrHigh)) * 4);
//            *(io*)(addr + CFGHR * IsLowOrHigh) |=
//                (7 << (num - (8 - num % 8) * IsLowOrHigh) * 4);
//            break;
//        case ALTERNATE_PUSH_PULL:
//            *(io*)(addr + CFGHR * IsLowOrHigh) &=
//                ~(0xF << (num - (8 - num % 8) * (IsLowOrHigh)) * 4);
//            *(io*)(addr + CFGHR * IsLowOrHigh) |=
//                (0xB << (num - (8 - num % 8) * IsLowOrHigh) * 4);
//            break;
//        case ALTERNATE_OPEN_DRAIN:
//            *(io*)(addr + CFGHR * IsLowOrHigh) |=
//                (0xF << (num - (8 - num % 8) * IsLowOrHigh) * 4);
//            break;
//        }
//    }
//    static constexpr void setHigh() { *(io*)(addr + BSHR) = (0x1 << num); }
//    static constexpr void setLow() {
//        *(io*)(addr + BSHR) = (0x1 << (num + 16));
//    }
//    static constexpr void toggle() { *(io*)(addr + OUTDR) ^= (0x1 << num); }
//    static constexpr bool getState() {
//        return (*(io*)(addr + INDR) & (0x1 << num));
//    }
//
//  private:
//    static constexpr bool isLowOrHigh() { return (num < 8) ? false : true; }
//    static constexpr bool IsLowOrHigh = isLowOrHigh();
//    static constexpr uint32_t GPIO_ADDR() {
//        // return (Regs::GPIOA_BASE_C + portName*0x400);
//        if (PA == portName) {
//            return GPIOA_BASE;
//        } else if (PB == portName) {
//            return GPIOB_BASE;
//        } else if (PC == portName) {
//            return GPIOC_BASE;
//        } else if (PD == portName) {
//            return GPIOD_BASE;
//        } else
//            return GPIOE_BASE;
//    }
//    static constexpr uint32_t addr = GPIO_ADDR();
//    static constexpr void setRCC() {
//        if (portName == PA) {
//            RCC->APB2PCENR |= RCC_IOPAEN;
//        } else if (portName == PB) {
//            RCC->APB2PCENR |= RCC_IOPBEN;
//        } else if (portName == PC) {
//            RCC->APB2PCENR |= RCC_IOPCEN;
//        } else if (portName == PD) {
//            RCC->APB2PCENR |= RCC_IOPDEN;
//        } else {
//            RCC->APB2PCENR |= RCC_IOPEEN;
//        }
//    }
//};

} // namespace Gpios

#endif // GPIOS_H
